In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
obj = pd.Series([1,5, 10, 4])
obj

0     1
1     5
2    10
3     4
dtype: int64

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj.values

array([ 1,  5, 10,  4])

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2["b"]

7

In [9]:
obj2[["b", "a"]]

b    7
a   -5
dtype: int64

In [12]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [15]:
obj2.max()

7

In [16]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [17]:
7 in obj2

False

In [18]:
"b" in obj2

True

In [20]:
7 in obj2.values

True

In [21]:
sdata = {"Istanbul": 18000000, "Izmir": 4500000,
         "Bursa": 1800000, "Ankara": 5500000}

obj3 = pd.Series(sdata)
obj3

Istanbul    18000000
Izmir        4500000
Bursa        1800000
Ankara       5500000
dtype: int64

In [22]:
sdata2 = {"Ankara": 6000000, "Istanbul": 20000000,
         "Izmir": 4800000, "Bursa": 2000000}

obj4 = pd.Series(sdata2)
obj4

Ankara       6000000
Istanbul    20000000
Izmir        4800000
Bursa        2000000
dtype: int64

In [24]:
(obj3 + obj4) / 2

Ankara       5750000.0
Bursa        1900000.0
Istanbul    19000000.0
Izmir        4650000.0
dtype: float64

In [26]:
d = {
    "Name": ["John", "Alice", "Jack", "Rose", "Alex", "David"],
    "Age": [32, 23, 21, 35, 45, 48],
    "City": ["Istanbul", "Paris", "London", "Madrid", "Sao Paulo", "Miami"]
}

data = pd.DataFrame(d)
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [27]:
data.shape

(6, 3)

In [28]:
data.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [29]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [30]:
data.values

array([['John', 32, 'Istanbul'],
       ['Alice', 23, 'Paris'],
       ['Jack', 21, 'London'],
       ['Rose', 35, 'Madrid'],
       ['Alex', 45, 'Sao Paulo'],
       ['David', 48, 'Miami']], dtype=object)

In [31]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [32]:
data.head() # displays first 5 rows

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo

In [33]:
data.head(3)

    Name  Age      City
0   John   32  Istanbul
1  Alice   23     Paris
2   Jack   21    London

In [34]:
data.tail() # display last 5 rows

    Name  Age       City
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [35]:
data.tail(2)

    Name  Age       City
4   Alex   45  Sao Paulo
5  David   48      Miami

In [37]:
type(data)

pandas.core.frame.DataFrame

In [38]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [39]:
data["City"]

0     Istanbul
1        Paris
2       London
3       Madrid
4    Sao Paulo
5        Miami
Name: City, dtype: object

In [40]:
type(data["City"])

pandas.core.series.Series

In [42]:
data[["City", "Age"]]

        City  Age
0   Istanbul   32
1      Paris   23
2     London   21
3     Madrid   35
4  Sao Paulo   45
5      Miami   48

In [43]:
data["City"] # returns a Series object

0     Istanbul
1        Paris
2       London
3       Madrid
4    Sao Paulo
5        Miami
Name: City, dtype: object

In [44]:
data[["City"]]  # returns a DataFrame object

        City
0   Istanbul
1      Paris
2     London
3     Madrid
4  Sao Paulo
5      Miami

In [45]:
data.City # data["City"]

0     Istanbul
1        Paris
2       London
3       Madrid
4    Sao Paulo
5        Miami
Name: City, dtype: object

In [46]:
data.shape

(6, 3)

In [47]:
d

{'Name': ['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David'],
 'Age': [32, 23, 21, 35, 45, 48],
 'City': ['Istanbul', 'Paris', 'London', 'Madrid', 'Sao Paulo', 'Miami']}

In [48]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [49]:
data["debt"] = 23.5
data

    Name  Age       City  debt
0   John   32   Istanbul  23.5
1  Alice   23      Paris  23.5
2   Jack   21     London  23.5
3   Rose   35     Madrid  23.5
4   Alex   45  Sao Paulo  23.5
5  David   48      Miami  23.5

In [50]:
data["Country"] = ["Turkiye", "France", "UK", "Spain", "Brazil", "US"]
data

    Name  Age       City  debt  Country
0   John   32   Istanbul  23.5  Turkiye
1  Alice   23      Paris  23.5   France
2   Jack   21     London  23.5       UK
3   Rose   35     Madrid  23.5    Spain
4   Alex   45  Sao Paulo  23.5   Brazil
5  David   48      Miami  23.5       US

In [51]:
data["Country"] = ["Turkiye", "France", "United Kingdom", "Spain", "Brazil", "US"]
data

    Name  Age       City  debt         Country
0   John   32   Istanbul  23.5         Turkiye
1  Alice   23      Paris  23.5          France
2   Jack   21     London  23.5  United Kingdom
3   Rose   35     Madrid  23.5           Spain
4   Alex   45  Sao Paulo  23.5          Brazil
5  David   48      Miami  23.5              US